INSERT INTO 등록(학번, 과목번호, 성적, 중간성적, 기말성적)
VALUES(100, 'C413', 'A', 90, 95),
(100, 'E412', 'A', 95, 95),
(200, 'C123', 'B', 85, 80),
(300, 'C312', 'A', 90, 95),
(300, 'C324', 'C', 75, 75),
(300, 'C413', 'A', 95, 90),
(400, 'C312', 'A', 90, 95),
(400, 'C324', 'A', 95, 90),
(400, 'C413', 'B', 80, 85),
(400, 'E412', 'C', 65, 75),
(500, 'C312', 'B', 85, 80);

INSERT INTO 과목 (과목번호, 과목이름, 학점, 학과, 담당교수)
VALUES (‘C312’, ‘자료 구조’, 3, ‘컴퓨터’, ‘황수관’),
VALUES (‘C324’, ‘화일 구조’, 3, ‘컴퓨터’, ‘이규찬’),
VALUES (‘C413’, ‘데이터베이스’, 3, ‘컴퓨터’, ‘이일로’),
VALUES (‘E412’, ‘반도체’, 3, ‘전자’, ‘홍봉진’);
